# -*- coding: utf-8 -*-
'''
Задание 5.2a

Всё, как в задании 5.2, но, если пользователь ввел адрес хоста, а не адрес сети,
надо преобразовать адрес хоста в адрес сети и вывести адрес сети и маску, как в задании 5.2.

Пример адреса сети (все биты хостовой части равны нулю):
* 10.0.1.0/24
* 190.1.0.0/16

Пример адреса хоста:
* 10.0.1.1/24 - хост из сети 10.0.1.0/24
* 10.0.5.1/30 - хост из сети 10.0.5.0/30

Если пользователь ввел адрес 10.0.1.1/24,
вывод должен быть таким:

Network:
10        0         1         0
00001010  00000000  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Ограничение: Все задания надо выполнять используя только пройденные темы.

'''

ipinput = input('Введите IP-сеть в формате X.X.X.X/X: ')
ip = ipinput.split('/')[0].split('.')
mask = ipinput.split('/')[1]
binmask = (int(mask) * '1' + (32 - int(mask)) * '0')


print(int(ip[0]) & int(binmask[0:8],2))
oct1 = int(ip[0]) & int(binmask[0:8],2)
oct2 = int(ip[1]) & int(binmask[8:16],2)
oct3 = int(ip[2]) & int(binmask[16:24],2)
oct4 = int(ip[3]) & int(binmask[24:32],2)

iptemplate = '''
Network:
{0:<8} {1:<8} {2:<8} {3:<8}
{0:08b} {1:08b} {2:08b} {3:08b}
'''

masktemplate = '''
{0:<8} {1:<8} {2:<8} {3:<8}
{0:08b} {1:08b} {2:08b} {3:08b}
'''

print(iptemplate.format(oct1, oct2, oct3, oct4))
print('Mask:\n' + '/' + mask)
print(masktemplate.format(int(binmask[0:8],2), int(binmask[8:16],2), int(binmask[16:24],2), int(binmask[24:32],2)))
